{
  "甲子": {
      "十干": "甲",
      "十二支": "子",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙丑": {
      "十干": "乙",
      "十二支": "丑",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙寅": {
      "十干": "丙",
      "十二支": "寅",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁卯": {
      "十干": "丁",
      "十二支": "卯",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊辰": {
      "十干": "戊",
      "十二支": "辰",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己巳": {
      "十干": "己",
      "十二支": "巳",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚午": {
      "十干": "庚",
      "十二支": "午",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛未": {
      "十干": "辛",
      "十二支": "未",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬申": {
      "十干": "壬",
      "十二支": "申",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸酉": {
      "十干": "癸",
      "十二支": "酉",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  },
  "甲戌": {
      "十干": "甲",
      "十二支": "戌",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙亥": {
      "十干": "乙",
      "十二支": "亥",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙子": {
      "十干": "丙",
      "十二支": "子",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁丑": {
      "十干": "丁",
      "十二支": "丑",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊寅": {
      "十干": "戊",
      "十二支": "寅",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己卯": {
      "十干": "己",
      "十二支": "卯",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚辰": {
      "十干": "庚",
      "十二支": "辰",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛巳": {
      "十干": "辛",
      "十二支": "巳",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬午": {
      "十干": "壬",
      "十二支": "午",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸未": {
      "十干": "癸",
      "十二支": "未",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  },
  "甲申": {
      "十干": "甲",
      "十二支": "申",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙酉": {
      "十干": "乙",
      "十二支": "酉",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙戌": {
      "十干": "丙",
      "十二支": "戌",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁亥": {
      "十干": "丁",
      "十二支": "亥",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊子": {
      "十干": "戊",
      "十二支": "子",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己丑": {
      "十干": "己",
      "十二支": "丑",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚寅": {
      "十干": "庚",
      "十二支": "寅",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛卯": {
      "十干": "辛",
      "十二支": "卯",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬辰": {
      "十干": "壬",
      "十二支": "辰",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸巳": {
      "十干": "癸",
      "十二支": "巳",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  },
  "甲午": {
      "十干": "甲",
      "十二支": "午",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙未": {
      "十干": "乙",
      "十二支": "未",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙申": {
      "十干": "丙",
      "十二支": "申",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁酉": {
      "十干": "丁",
      "十二支": "酉",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊戌": {
      "十干": "戊",
      "十二支": "戌",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己亥": {
      "十干": "己",
      "十二支": "亥",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚子": {
      "十干": "庚",
      "十二支": "子",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛丑": {
      "十干": "辛",
      "十二支": "丑",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬寅": {
      "十干": "壬",
      "十二支": "寅",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸卯": {
      "十干": "癸",
      "十二支": "卯",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  },
  "甲辰": {
      "十干": "甲",
      "十二支": "辰",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙巳": {
      "十干": "乙",
      "十二支": "巳",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙午": {
      "十干": "丙",
      "十二支": "午",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁未": {
      "十干": "丁",
      "十二支": "未",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊申": {
      "十干": "戊",
      "十二支": "申",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己酉": {
      "十干": "己",
      "十二支": "酉",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚戌": {
      "十干": "庚",
      "十二支": "戌",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛亥": {
      "十干": "辛",
      "十二支": "亥",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬子": {
      "十干": "壬",
      "十二支": "子",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸丑": {
      "十干": "癸",
      "十二支": "丑",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  },
  "甲寅": {
      "十干": "甲",
      "十二支": "寅",
      "五行": "木",
      "陰陽": "陽",
      "先天螺旋": "風"
  },
  "乙卯": {
      "十干": "乙",
      "十二支": "卯",
      "五行": "木",
      "陰陽": "陰",
      "先天螺旋": "地"
  },
  "丙辰": {
      "十干": "丙",
      "十二支": "辰",
      "五行": "火",
      "陰陽": "陽",
      "先天螺旋": "火"
  },
  "丁巳": {
      "十干": "丁",
      "十二支": "巳",
      "五行": "火",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "戊午": {
      "十干": "戊",
      "十二支": "午",
      "五行": "土",
      "陰陽": "陽",
      "先天螺旋": "地"
  },
  "己未": {
      "十干": "己",
      "十二支": "未",
      "五行": "土",
      "陰陽": "陰",
      "先天螺旋": "識"
  },
  "庚申": {
      "十干": "庚",
      "十二支": "申",
      "五行": "金",
      "陰陽": "陽",
      "先天螺旋": "識"
  },
  "辛酉": {
      "十干": "辛",
      "十二支": "酉",
      "五行": "金",
      "陰陽": "陰",
      "先天螺旋": "空"
  },
  "壬戌": {
      "十干": "壬",
      "十二支": "戌",
      "五行": "水",
      "陰陽": "陽",
      "先天螺旋": "水"
  },
  "癸亥": {
      "十干": "癸",
      "十二支": "亥",
      "五行": "水",
      "陰陽": "陰",
      "先天螺旋": "風"
  }
}